rost0031/STM32491_CPLR/Firmware/Bootloader/src/app/CommMgr.c
/* Private macros ------------------------------------------------------------*/
/* Private variables and Local objects ---------------------------------------*/
pFunction Jump_To_Application;
uint32_t JumpAddress;

static CommMgr l_CommMgr; /* the single instance of the Interstage active object */

/* Global-scope objects ----------------------------------------------------*/
QActive * const AO_CommMgr = (QActive *)&l_CommMgr;  /* "opaque" AO pointer */

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
 * @brief C "constructor" for CommMgr "class".
 * Initializes all the timers and queues used by the AO and sets of the
 * first state.
 * @param  None
 * @param  None
 * @retval None
 */
/*${AOs::CommMgr_ctor} .....................................................*/
void CommMgr_ctor(void) {
    CommMgr *me = &l_CommMgr;
    QActive_ctor(&me->super, (QStateHandler)&CommMgr_initial);
    QTimeEvt_ctor(&me->msgTimerEvt, CLI_MSG_TIMEOUT_SIG);
}

/**
 * @brief	Wrapper around serial and UDP send data function.
 * This function acts as a simple wrapper around serial and UDP ethernet send data
 * functions to allow easy posting of events to send out data over those interfaces.
 * @param [in] *evt: LrgDataEvt pointer to event to send.
 * @return: CBErrorCode indicating status of operation.
 */
/*${AOs::Comm_sendToClien~} ................................................*/
CBErrorCode Comm_sendToClient(LrgDataEvt* evt) {
    CBErrorCode status = ERR_NONE;
    if ( _CB_Serial == evt->dst ) {
        uint8_t encDataBuf[CB_MAX_MSG_LEN];
        memset(encDataBuf, 0, sizeof(encDataBuf));
        uint16_t encDataLen = base64_encode(
              (char *)(evt->dataBuf),
              evt->dataLen,
              (char *)encDataBuf,
              CB_MAX_MSG_LEN
        );

        if(encDataLen < 1) {
            status = ERR_SERIAL_MSG_BASE64_ENC_FAILED;
            ERR_printf(
                "Base64 encoding ran out of space, error: 0x%08x\n",
                status
            );
            /* Set so we don't error out copying.  Client should know how to
             * to properly handle this */
            encDataLen = 1;
        }

        /* Modify the contents of the event with the new encoded data and send
         * it regardless of whether we*/
        evt->dataLen = encDataLen;
        MEMCPY( evt->dataBuf, encDataBuf, evt->dataLen);
        evt->dst = _CB_Serial;
        evt->src = _CB_Serial;

        /* Directly post to the LWIPMgr AO. */
        QACTIVE_POST( AO_SerialMgr, (QEvt *)(evt), 0 );

    } else { /* Always attempt to send over UDP to prevent leaking the event */
        /* No modifications needed to the UDP send so just post it directly to that AO.*/
        /* Directly post to the LWIPMgr AO. */
        QACTIVE_POST( AO_LWIPMgr, (QEvt *)(evt), 0 );
    }

    /* If we got here, src or dst was not set up properly. */
    return status;
}

/**
 * \brief CommMgr "class"
 */
/*${AOs::CommMgr} ..........................................................*/
/*${AOs::CommMgr::SM} ......................................................*/
static QState CommMgr_initial(CommMgr * const me, QEvt const * const e) {
    /* ${AOs::CommMgr::SM::initial} */
    (void)e;        /* suppress the compiler warning about unused parameter */

    QS_OBJ_DICTIONARY(&l_CommMgr);
    QS_FUN_DICTIONARY(&QHsm_top);
    QS_FUN_DICTIONARY(&CommMgr_initial);
    QS_FUN_DICTIONARY(&CommMgr_Active);

    QActive_subscribe((QActive *)me, SER_RECEIVED_SIG);
    return Q_TRAN(&CommMgr_Idle);
}

/**
 * This state is a catch-all Active state.  If any signals need
 * to be handled that do not cause state transitions and are
 * common to the entire AO, they should be handled here.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active} ..............................................*/
static QState CommMgr_Active(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active} */
        case Q_ENTRY_SIG: {
            /* Arm and disarm*/
            QTimeEvt_postIn(
                &me->msgTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_CLI_MSG_PROCESS )
            );
            QTimeEvt_disarm(&me->msgTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&QHsm_top);
            break;
        }
    }
    return status_;
}

/**
 * @brief	Idle state that allows new messages to be received.
 * The Idle state allows for handling of new incoming msgs. Msgs in other states
 * will be either deferred or ignored.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active::Idle} ........................................*/
static QState CommMgr_Idle(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::Idle} */
        case Q_ENTRY_SIG: {
            /* Clear out all the variables on entry to Idle state.  By this point, any error
             * feedback should have already happened. */
            me->errorCode       = ERR_NONE;
            me->msgId           = 0;
            me->cliEvtSrc       = _CB_NoRoute;
            me->cliEvtDst       = _CB_NoRoute;
            me->msgRoute        = _CB_NoRoute;
            me->msgPayloadName  = _CBNoMsg;
            me->msgReqProg      = false;

            memset(&me->basicMsg, 0, sizeof(me->basicMsg));
            memset(&me->payloadMsgUnion, 0, sizeof(me->payloadMsgUnion));
            memset(me->dataBuf, 0, sizeof(me->dataBuf));
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Idle::SER_RECEIVED} */
        case SER_RECEIVED_SIG: {
            DBG_printf("SER_RECIEVED\n");

            LrgDataEvt *cliEvt = Q_NEW(LrgDataEvt, CLI_RECEIVED_SIG);
            cliEvt->dataLen = base64_decode(
                (char *)((LrgDataEvt const *) e)->dataBuf,
                ((LrgDataEvt const *) e)->dataLen,
                (char *)cliEvt->dataBuf,
                CB_MAX_MSG_LEN
            );

