rost0031/STM32491_CPLR/Firmware/Bootloader/src/app/CommMgr.c
            cliEvt->src = ((LrgDataEvt const *) e)->src;
            cliEvt->dst = ((LrgDataEvt const *) e)->dst;

            QACTIVE_POST(
                AO_CommMgr,
                (QEvt *)(cliEvt),
                AO_CommMgr
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::Idle::CLI_RECEIVED} */
        case CLI_RECEIVED_SIG: {
            DBG_printf("CLI_RECIEVED\n");

            /* Extract the basicMsg first */
            memset(&(me->basicMsg), 0, sizeof(me->basicMsg));
            me->basicMsgOffset = CBBasicMsg_read_delimited_from(
                (void*)((LrgDataEvt const *) e)->dataBuf,
                &(me->basicMsg),
                0
            );

            /* Store the event source and destination before entering a new state where that
             * information will be lost. */
            me->cliEvtSrc = ((LrgDataEvt const *) e)->src;
            me->cliEvtDst = ((LrgDataEvt const *) e)->dst;

            /* Store the basic msg elements locally since they are needed to send back all the
             * ack, prog, and done replies. */
            me->msgRoute   = me->basicMsg._msgRoute;
            me->msgId      = me->basicMsg._msgID;
            me->msgReqProg = (bool)(me->basicMsg._msgReqProg);
            me->msgPayloadName = me->basicMsg._msgPayload; // save this since Ack will overwrite it

            /* Extract the payload (if exists) since this buffer is going away the moment we get
             * into a state.  We'll figure out later if it's valid, right before we send an Ack */
            switch( me->msgPayloadName ) {
                case _CBNoMsg:
                    DBG_printf("No payload detected\n");
                    break;
                case _CBStatusPayloadMsg:
                    WRN_printf("Status payload detected, this is probably an error\n");
                    break;
                case _CBVersionPayloadMsg:
                    WRN_printf("Version payload detected, this is probably an error\n");
                    break;
                case _CBBootModePayloadMsg:
                    DBG_printf("BootMode payload detected\n");
                    CBBootModePayloadMsg_read_delimited_from(
                        ((LrgDataEvt *) e)->dataBuf,
                        &(me->payloadMsgUnion.bootmodePayload),
                        me->basicMsgOffset
                    );
                    break;
                case _CBFlashMetaPayloadMsg:
                    DBG_printf("FlashMeta payload detected\n");
                    CBFlashMetaPayloadMsg_read_delimited_from(
                        ((LrgDataEvt *) e)->dataBuf,
                        &(me->payloadMsgUnion.flashMetaPayload),
                        me->basicMsgOffset
                    );
                    break;
                case _CBFlashDataPayloadMsg:
                    DBG_printf("FlashData payload detected\n");
                    CBFlashDataPayloadMsg_read_delimited_from(
                        ((LrgDataEvt *) e)->dataBuf,
                        &(me->payloadMsgUnion.flashDataPayload),
                        me->basicMsgOffset
                    );
                    break;
                default:
                    WRN_printf(
                        "Unknown payload detected: %d, this is probably an error\n",
                        me->msgPayloadName
                    );
                    break;
            }
            status_ = Q_TRAN(&CommMgr_ValidateMsg);
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Active);
            break;
        }
    }
    return status_;
}

/**
 * @brief	Busy state for msg processing.
 * This state handles msg processing and indicates that the system is busy and
 * cannot process another msg at this time.
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active::BusyWithMsg} .................................*/
static QState CommMgr_BusyWithMsg(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg} */
        case Q_ENTRY_SIG: {
            /* Arm the timer so if the message can't be processed for some reason, we can get
             * back to idle state.  This timer may be re-armed if some messages require more
             * time to process than others. */
            QTimeEvt_rearm(
                &me->msgTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_CLI_MSG_PROCESS )
            );

            /* Compose and send Ack response.  We can re-use the current structure since only
             * one non-essential field changes. */
            me->basicMsg._msgType    = _CB_Ack;
            me->basicMsg._msgPayload = _CBNoMsg; // This was saved earlier
            /* The rest of the fields are the same */

            /* Serialize the msg into a buffer of a fresh event. This event will be passed to
             * a function which will post it directly to the correct AO. */
            LrgDataEvt *evt = Q_NEW(LrgDataEvt, CLI_SEND_DATA_SIG);
            /* The src and dst are swapped on purpose since we have to tell the message to go
             * to where it originally came from. */
            evt->dst = me->cliEvtSrc;
            evt->src = me->cliEvtDst;
            evt->dataLen = CBBasicMsg_write_delimited_to(&(me->basicMsg), evt->dataBuf, 0);
            me->errorCode = Comm_sendToClient( evt );
            if ( ERR_NONE != me->errorCode ) {
                WRN_printf("Possible error sending Ack, attempting to continue. Error: 0x%08x\n", me->errorCode);
            }
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg} */
        case Q_EXIT_SIG: {
            /* Set the fields of the msg common for all Done msgs regardless of status or msg */
            me->basicMsg._msgType    = _CB_Done;
            me->basicMsg._msgRoute   = me->msgRoute;
            me->basicMsg._msgID      = me->msgId;
            me->basicMsg._msgReqProg = (unsigned long)me->msgReqProg;

            /* The command specific fields should have already been set up by their respective
             * exit transitions */
            LrgDataEvt *evt = Q_NEW(LrgDataEvt, CLI_SEND_DATA_SIG);
            evt->dataLen = CBBasicMsg_write_delimited_to(&me->basicMsg, evt->dataBuf, 0);
            /* The src and dst are swapped on purpose since we have to tell the message to go
             * to where it originally came from. */
            evt->dst = me->cliEvtSrc;
            evt->src = me->cliEvtDst;
            evt->dataLen = CBBasicMsg_write_delimited_to(&(me->basicMsg), evt->dataBuf, 0);

