rost0031/STM32491_CPLR/Firmware/Bootloader/src/app/CommMgr.c
            /* Append payload msg if needed */
            switch( me->msgPayloadName ) {
                case _CBStatusPayloadMsg:
                    DBG_printf("Sending status payload\n");
                    evt->dataLen = CBStatusPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.statusPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBVersionPayloadMsg:
                    DBG_printf("Sending version payload\n");
                    evt->dataLen = CBVersionPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.versionPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBBootModePayloadMsg:
                    DBG_printf("Sending bootMode payload\n");
                    evt->dataLen = CBBootModePayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.bootmodePayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBFlashMetaPayloadMsg:
                    DBG_printf("Sending FlashMeta payload\n");
                    evt->dataLen = CBFlashMetaPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.flashMetaPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBFlashDataPayloadMsg:
                    DBG_printf("Sending FlashData payload\n");
                    evt->dataLen = CBFlashDataPayloadMsg_write_delimited_to(
                        (void*)&(me->payloadMsgUnion.flashDataPayload),
                        evt->dataBuf,
                        evt->dataLen
                    );
                    break;
                case _CBNoMsg:
                    WRN_printf("Not sending payload as part of Done msg.\n");
                    break;
                default:
                    WRN_printf("Unknown payload detected %d, this is probably an error\n",
                        me->msgPayloadName
                    );
                    break;
            }

            /* Send the Done msg buffer to the client */
            me->errorCode = Comm_sendToClient( evt );
            if ( ERR_NONE != me->errorCode ) {
                WRN_printf("Possible error sending Done, attempting to continue. Error: 0x%08x\n", me->errorCode);
            }

            /* Disarm timer on exit */
            QTimeEvt_disarm(&me->msgTimerEvt);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg::CLI_MSG_TIMEOUT} */
        case CLI_MSG_TIMEOUT_SIG: {
            ERR_printf("Timeout trying to process %d basic msg, error: 0x%08x\n", me->errorCode);
            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_Active);
            break;
        }
    }
    return status_;
}

/**
 * @brief	State that ensures the system stays in the Busy state while processing.
 * This state just self-posts an event to start the msg processing. Its primary
 * reason for existance is to make sure that the state machine ends up inside the
 * busy state for proper error handling (if any occur).
 *
 * @param  [in|out] me: Pointer to the state machine
 * @param  [in|out]  e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg} ....................*/
static QState CommMgr_ValidateMsg(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg} */
        case Q_ENTRY_SIG: {
            /* Post to self to leave the state and continue processing the rest of the msg */
            QEvt *evt = Q_NEW(QEvt, MSG_PROCESS_SIG);
            QACTIVE_POST(AO_CommMgr, (QEvt *)(evt), AO_CommMgr);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS} */
        case MSG_PROCESS_SIG: {
            DBG_printf("MSG_PROCESS\n");
            /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS::[GetBootMode?]} */
            if (_CBGetBootModeMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_CBGetBootModeMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _CBBootModePayloadMsg;

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.bootmodePayload._errorCode = me->errorCode;
                me->payloadMsgUnion.bootmodePayload._bootMode  = _CB_Bootloader; // This is the bootloader
                DBG_printf("Setting bootMode payload with bootmode: %d\n", me->payloadMsgUnion.bootmodePayload._bootMode);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS::[SetBootMode?]} */
            else if (_CBSetBootModeMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_CBSetBootModeMsg decoded, attempting to decode payload (if exists)\n");

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _CBStatusPayloadMsg;

                /* Don't change the basicMsg name since it should be the same in all cases. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;
                DBG_printf("Setting status payload with error code: %d\n", me->payloadMsgUnion.statusPayload._errorCode);
                status_ = Q_TRAN(&CommMgr_Idle);
            }
            /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS::[Flash?]} */
            else if (_CBFlashMsg == me->basicMsg._msgName) {
                me->errorCode = ERR_NONE;

                DBG_printf("_CBFlashMsg decoded, attempting to decode payload (if exists)\n");

                /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS::[Flash?]::[FlashMetaPayloa~} */
                if (_CBFlashMetaPayloadMsg == me->msgPayloadName) {
                    /* The flash meta payload is the start of the FW update.  The meta payload contains
                     * all the information about the coming fw data.  We need to store this so it can be
                     * used to keep track of the FW flash process. */

                    /* 1. Create a FWMetaEvt and send it along to FlashMgr AO to prep the flash */
                    FWMetaEvt *evt = Q_NEW(FWMetaEvt, FLASH_OP_START_SIG);
                    evt->imageCRC  = me->payloadMsgUnion.flashMetaPayload._imageCrc;
                    evt->imageMaj  = me->payloadMsgUnion.flashMetaPayload._imageMaj;
                    evt->imageMin  = me->payloadMsgUnion.flashMetaPayload._imageMin;
                    evt->imageSize = me->payloadMsgUnion.flashMetaPayload._imageSize;
                    evt->imageType = me->payloadMsgUnion.flashMetaPayload._imageType;
                    MEMCPY(
                        evt->imageDatetime,
                        me->payloadMsgUnion.flashMetaPayload._imageDatetime,
                        CB_DATETIME_LEN
                    );
                    QACTIVE_POST(AO_FlashMgr, (QEvt *)(evt), AO_CommMgr);

                    /* Compose Done response.  We can re-use the current structure and it will be used by
                     * the exit action of the parent state to send the msg.  Here, we only set up fields
                     * that are specific to this response. We can also destructively change the payload
                     * name since we are sending a response right after this. */
                    me->msgPayloadName = _CBStatusPayloadMsg;

                    /* Don't change the basicMsg name since it should be the same in all cases. */
                    me->basicMsg._msgPayload = me->msgPayloadName;

                    /* Rearm the timer since this operation is slow */
                    QTimeEvt_rearm(
                        &me->msgTimerEvt,
                        SEC_TO_TICKS( LL_MAX_TOUT_SEC_CLI_FW_META_WAIT )
                    );

                    status_ = Q_TRAN(&CommMgr_WaitForRespFromFlashMgr);
                }
                /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS::[Flash?]::[FlashDataPayloa~} */
                else if (_CBFlashMetaPayloadMsg == me->msgPayloadName) {
                    /* The flash data payload is used to transfer the FW data packets to FlashMgr AO. */

                    /* 1. Create a FWMetaEvt and send it along to FlashMgr AO to prep the flash */
                    FWDataEvt *evt = Q_NEW(FWDataEvt, FLASH_DATA_SIG);
                    evt->dataCRC  = me->payloadMsgUnion.flashDataPayload._dataCrc;
                    evt->dataLen  = me->payloadMsgUnion.flashDataPayload._dataLen;
                    evt->seqCurr  = me->payloadMsgUnion.flashDataPayload._seqCurr;
                    evt->seqTotal = me->payloadMsgUnion.flashDataPayload._seqTotal;
                    MEMCPY(
                        evt->dataBuf,
                        me->payloadMsgUnion.flashDataPayload._dataBuf,
                        evt->dataLen
                    );
                    QACTIVE_POST(AO_FlashMgr, (QEvt *)(evt), AO_CommMgr);



                    /* Compose Done response.  We can re-use the current structure and it will be used by
                     * the exit action of the parent state to send the msg.  Here, we only set up fields
                     * that are specific to this response. We can also destructively change the payload
                     * name since we are sending a response right after this. */
                    me->msgPayloadName = _CBStatusPayloadMsg;

                    /* Don't change the basicMsg name since it should be the same in all cases. */
                    me->basicMsg._msgPayload = me->msgPayloadName;

                    /* Rearm the timer since this operation is slow */
                    QTimeEvt_rearm(
                        &me->msgTimerEvt,
                        SEC_TO_TICKS( LL_MAX_TOUT_SEC_CLI_FW_META_WAIT )
                    );
                    status_ = Q_TRAN(&CommMgr_WaitForRespFromFlashMgr);
                }
                else {
                    status_ = Q_UNHANDLED();
                }
            }
            /* ${AOs::CommMgr::SM::Active::BusyWithMsg::ValidateMsg::MSG_PROCESS::[else]} */
            else {
                me->errorCode = ERR_MSG_UNKNOWN_BASIC;
                ERR_printf(
                    "Unknown msg (%d) with msgId=%d. Sending back error: 0x%08x\n",
                    me->basicMsg._msgName, me->msgId, me->errorCode);

                /* Compose Done response.  We can re-use the current structure and it will be used by
                 * the exit action of the parent state to send the msg.  Here, we only set up fields
                 * that are specific to this response. We can also destructively change the payload
                 * name since we are sending a response right after this. */
                me->msgPayloadName = _CBStatusPayloadMsg;

                /* Don't change the basicMsg name since we don't actually know what it is but add a
                 * status payload msg to let the user know the error. */
                me->basicMsg._msgPayload = me->msgPayloadName;
                me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;



                status_ = Q_TRAN(&CommMgr_Idle);
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_BusyWithMsg);
            break;
        }
    }
    return status_;
}
/*${AOs::CommMgr::SM::Active::BusyWithMsg::WaitForRespFromF~} ..............*/
static QState CommMgr_WaitForRespFromFlashMgr(CommMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg::WaitForRespFromF~} */
        case Q_ENTRY_SIG: {
            me->errorCode = ERR_COMM_FLASHMGR_TIMEOUT; /* Set the error in case we timeout */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg::WaitForRespFromF~::FLASH_OP_DONE} */
        case FLASH_OP_DONE_SIG: {
            me->errorCode = ((FlashStatusEvt const *)e)->errorCode;
            DBG_printf("FLASH_OP_DONE with status: 0x%08x\n", me->errorCode);

            me->payloadMsgUnion.statusPayload._errorCode = me->errorCode;
            DBG_printf("Setting status payload with error code: %d\n", me->payloadMsgUnion.statusPayload._errorCode);

            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        /* ${AOs::CommMgr::SM::Active::BusyWithMsg::WaitForRespFromF~::FLASH_FW_DONE} */
        case FLASH_FW_DONE_SIG: {
            me->errorCode = ((FWMetaEvt const *)e)->errorCode;
            DBG_printf("FLASH_FW_DONE with status: 0x%08x\n", me->errorCode);

