rost0031/STM32491_CPLR/Firmware/Bootloader/src/app/CommMgr.c
            /* Overwrite the done response since the FW flashing is complete; we have to send the
             * metadata back so the client can be happy that we did things correctly.  We can
             * re-use the current structure and it will be used by the exit action of the parent
             * state to send the msg.  Here, we only set up fields that are specific to this
             * response. We can also destructively change the payload name since we are sending
             * a response right after this. */
            me->msgPayloadName = _CBFlashMetaPayloadMsg;
            me->basicMsg._msgPayload = me->msgPayloadName;

            /* Set up the payload msg here */
            me->payloadMsgUnion.flashMetaPayload._errorCode = me->errorCode;
            me->payloadMsgUnion.flashMetaPayload._imageCrc  = ((FWMetaEvt const *)e)->imageCRC;
            me->payloadMsgUnion.flashMetaPayload._imageMaj  = ((FWMetaEvt const *)e)->imageMaj;
            me->payloadMsgUnion.flashMetaPayload._imageMin  = ((FWMetaEvt const *)e)->imageMin;
            me->payloadMsgUnion.flashMetaPayload._imageSize = ((FWMetaEvt const *)e)->imageSize;
            me->payloadMsgUnion.flashMetaPayload._imageType = ((FWMetaEvt const *)e)->imageType;
            MEMCPY(
                me->payloadMsgUnion.flashMetaPayload._imageDatetime,
                ((FWMetaEvt const *)e)->imageDatetime,
                CB_DATETIME_LEN
            );

            DBG_printf("Setting flash meta payload with error code: %d\n", me->payloadMsgUnion.flashMetaPayload._errorCode);

            status_ = Q_TRAN(&CommMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&CommMgr_BusyWithMsg);
            break;
        }
    }
    return status_;
}


/**
 * @} end addtogroup groupComm
 */

/******** Copyright (C) 2014 Datacard. All rights reserved *****END OF FILE****/
